SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( K4020B
	Type ( Engine )
	WagonShape ( "K4020B.s" )
	Thumbnail ( "Cab7000a.ace" )
	Size ( 2.73m 3.3m 14.245m )
	CentreOfGravity ( 0m 0m 0m )
	Mass ( 35t )
	WheelRadius ( 0.5m )
	InertiaTensor ( Box ( 2.73m 3.3m 14.245m ) )
	FreightAnim ( ksicherung_hinten.s 1 1 )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingUniqueType ( "Scharfenberg" )
		CouplingHasRigidConnection (  )
		Velocity ( 1m/s )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 3cm )
	DerailRailForce ( 70kN )
	DerailBufferForce ( 40kN )
	NumWheels ( 4 )
	Friction (
		150N/m/s	1	-1mph	0N/m/s	1
		5.1N/rad/s	1	-1rad/s	0N/rad/s	1
	)
	AntiSlip (  )
	BrakeEquipmentType ( "ep_brake" )
	BrakeSystemType ( EP )
	MaxBrakeForce ( 96.021948kN )
	EmergencyBrakeResMaxPressure ( 90 )
	TripleValveRatio ( 1 )
	MaxReleaseRate ( 20 )
	MaxApplicationRate ( 20 )
	MaxAuxilaryChargingRate ( 1 )
	EmergencyResCapacity ( 1 )
	EmergencyResChargingRate ( 1 )
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 50 )

	PassengerCapacity ( 90 )
	Lights ( 8
		Light (
			comment ( hinten rechts aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 3 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( -0.773 1.159 -7 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
				)
			)
		)
		Light (
			comment ( hinten links aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 3 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( 0.773 1.159 -6.95 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
				)
			)
		)
		Light (
			comment ( hinten rechts abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 3 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( -0.773 1.159 -7 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.15 )
				)
			)
		)
		Light (
			comment ( hinten links abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 3 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( 0.773 1.159 -6.95 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.15 )
				)
			)
		)
		Light (
			comment ( Licht #7 )
			Type ( 0 )
			Conditions (
				Control ( 1 )
				Service ( 1 )
			)
			FadeIn ( 0 )
			FadeOut ( 0 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( -0.773 1.159 -7 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.15 )
				)
			)
		)
		Light (
			comment ( Licht #8 )
			Type ( 0 )
			Conditions (
				Control ( 1 )
				Service ( 1 )
			)
			FadeIn ( 0 )
			FadeOut ( 0 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( 0.773 1.159 -6.95 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.15 )
				)
			)
		)
		Light (
			comment ( AI hinten rechts  )
			Type ( 0 )
			Conditions (
				Unit ( 3 )
				Control ( 1 )
				Service ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( -0.773 1.159 -7 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
				)
			)
		)
		Light (
			comment ( AI hinten links  )
			Type ( 0 )
			Conditions (
				Unit ( 3 )
				Control ( 1 )
				Service ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFF0000 )
					Position ( 0.773 1.159 -6.95 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
				)
			)
		)
	)
	Sound ( "k4000eng.SMS" )
)

Engine ( K4020B
	Wagon ( "K4020B" )
	Type ( Electric )
	MaxPower ( 120kW )
	MaxForce ( 55kN )
	MaxContinuousForce ( 50kN )
	MaxVelocity ( 80km/h )
	MaxCurrent ( 470A )
	WheelRadius ( 0.5m )
	MaxSandingTime ( -1 )
	NumWheels ( 4 )

	AirBrakesAirCompressorPowerRating ( 4 )
	AirBrakesAirCompressorWattage ( 19000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.5 )
	AirBrakesCompressorRestartPressure ( 95 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 1 )
	AirBrakesMainMaxAirPressure ( 100 )
	AirBrakesMainMinResAirPressure ( 30 )
	AirBrakesMainResVolume ( 1 )
	EngineBrakesControllerMaxApplicationRate ( 10 )
	EngineBrakesControllerMaxReleaseRate ( 20 )
	EngineBrakesControllerEmergencyApplicationRate ( 10 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	EngineBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesControllerHasProportionalBrake ( 1 )
	TrainBrakesControllerMinPressureReduction ( 6 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 20 )
	TrainBrakesControllerEmergencyApplicationRate ( 10 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	TrainBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesProportionalBrakeLag ( 0.9 )

	DynamicBrakesMinUsableSpeed ( -87 )
	DynamicBrakesMaximumEffectiveSpeed ( -37 )
	DynamicBrakesMaximumForce ( 43kN )
	DynamicBrakesResistorCurrentLimit ( 500 )
	DynamicBrakesCutInSpeed ( -86 )
	DynamicBrakesFadingSpeed ( 37 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 87 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 2 )
	DynamicBrakeHasAutoBailOff ( 1 )
	BrakesTrainBrakeType ( EP )
	BrakesEngineControllers ( "Train,Dynamic" )
	CabView ( "K4000cab.cvf" )

	DoesHornTriggerBell ( 0 )

	EmergencyStopMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 0 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnResetButton ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)

	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 1.0 0 Dummy )
			)
		)
		Brake_Train ( 0 1 0.333333333333333 0
			NumNotches ( 4
				Notch ( 0 0 TrainBrakesControllerReleaseStart )
				Notch ( 0.333333 1 TrainBrakesControllerEPApplyStart )
				Notch ( 0.666666 0 TrainBrakesControllerFullServiceStart )
				Notch ( 1.0 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Throttle ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 1.0 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.5 0.5 throttle dynamic )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 0 )
		Horn ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
		Wipers ( 0 1 0 )
	)

	Name ( "K4020B" )
	Sound ( "K4000cab.SMS" )

	Description (
		"Serie K4000 der Kölner Verkehrsbetriebe:\nDer Niederflur-Stadtbahnwagen ist ein Zweirichtungs-Gelenktriebwagen. Er wurde in modularer Bauweise von der Firma Bombardier Eurorail entwickelt und gebaut. Die elektrischen Systeme wurden von der Firma Kiepe Elektrik integriert.\n" +
		"Das Fahrzeug ist zu 72% niederflurig und kann sowohl einzeln als auch im Verband mit zwei oder drei, in Ausnahmefällen mit vier Fahrzeugen betrieben werden.\n\n" +
		"Höchstgeschwindigkeit: 80km/h\n" +
		"Wagenlänge über Kupplung: 29.410 mm\n" +
		"Wagenbreite über Blech: 2.650 mm\n" +
		"Wagenhöhe (höchster Punkt über SO): 3.510 mm\n" +
		"Gesamtkapazität: 184 Plätze\n" +
		"Spurweite: 1.435 mm"
	)
	EngineOperatingProcedures (
		"So setzen Sie den Zug in Bewegung\n1. 	Der Stromabnehmer wurde bereits ausgefahren.\n" +
		"2.	Drücken Sie die D-TASTE, um den Sollwertgeber in die Position Nullstellung zu stellen.\n" +
		"	Hinweis: Wenn sich der Sollwertgeber in der Stellung Nullstellung befindet, leuchtet eine grünes Licht auf.\n" +
		"3.	Drücken Sie die W-TASTE, um den Betriebsartenwahlschalter auf  Vorwärts zu stellen.\n" +
		"	Hinweis: Der Betriebsartenwahlschalter kann nur bedient werden, wenn sich der Sollwertgeber in der Stellung Nullstellung befindet.\n" +
		"4.	Drücken Sie die D-TASTE, um den Sollwertgeber in die Stellung 1 zu stellen.\n" +
		"5.	Wenn Sie schneller fahren möchten, drücken Sie die D-TASTE, um den Sollwertgeber in eine höhere Stellung zu bewegen.\n" +
		"So bremsen Sie den Zug ab\n" +
		"1.	Drücken Sie die A-TASTE, um den Sollwertgeber nach unten zu bewegen. Wenn sie den Sollwertgeber noch weiter nach hinten bewegen, bremst der Zug ab.\n" +
		"So lösen Sie die Notbremse aus\n" +
		"1.	Drücken Sie die A-TASTE, um den Sollwertgeber zur höchsten Bremseinstellung zu bewegen.\n" +
		"So fahren Sie rückwärts\n" +
		"1.	Halten Sie den Zug vollständig an.\n" +
		"2.	Drücken Sie die S-TASTE, um den Betriebsartenwahlschalter in die Position Rückwärts zu stellen.\n" +
		"	Hinweis: Der Betriebsartenwahlschalter kann nur bedient werden, wenn sich der Sollwertgeber in der Stellung Nullstellung befindet.\n" +
		"3.	Schieben Sie den Sollwertgeber langsam nach vorne (D-TASTE).\n\n" +
		"So lassen Sie Fahrgäste ein- und aussteigen\n" +
		"1. Halten Sie an einer Haltestelle.\n" +
		"2. Drücken Sie die EINGABETASTE.\n" +
		"3. Drücken Sie die P-Taste, um die Türen zu öffnen.\n" +
		"4. Warten Sie auf das 'Signal zur Abfahrt'.\n" +
		"5. Drücken Sie die P-Taste, um die Türen zu schließen.\n" +
		"TIPP: Verwenden Sie die Lokführerinformation 'Nächster Halt' (F10), um das Ein- und Aussteigen zu überwachen."
	)
)
